In [1]:
import pandas as pd

In [2]:
technologies = {
    'Courses':["Spark","PySpark","Python","pandas"],
    'Fee' :[20000,25000,22000,30000],
    'Duration':['30days','40days','35days','50days'],
              }

In [3]:
index_labels=['r1','r2','r3','r4']

In [4]:
df1 = pd.DataFrame(technologies,index=index_labels)

In [6]:
technologies2 = {
    'Courses':["Spark","Java","Python","Go"],
    'Discount':[2000,2300,1200,2000]
}

In [7]:
index_labels2=['r1','r6','r3','r5']

In [8]:
df2 = pd.DataFrame(technologies2,index=index_labels2)

In [9]:
df3=df1.join(df2, lsuffix="_left", rsuffix="_right")

In [10]:
df3

   Courses_left    Fee Duration Courses_right  Discount
r1        Spark  20000   30days         Spark    2000.0
r2      PySpark  25000   40days           NaN       NaN
r3       Python  22000   35days        Python    1200.0
r4       pandas  30000   50days           NaN       NaN

In [11]:
df3=df1.join(df2, lsuffix="_left", rsuffix="_right", how='inner')

In [12]:
df3

   Courses_left    Fee Duration Courses_right  Discount
r1        Spark  20000   30days         Spark      2000
r3       Python  22000   35days        Python      1200

In [13]:
df3=df1.join(df2, lsuffix="_left", rsuffix="_right", how='right')
print(df3)

   Courses_left      Fee Duration Courses_right  Discount
r1        Spark  20000.0   30days         Spark      2000
r6          NaN      NaN      NaN          Java      2300
r3       Python  22000.0   35days        Python      1200
r5          NaN      NaN      NaN            Go      2000

In [14]:
df3=df1.join(df2, lsuffix="_left", rsuffix="_right", how='outer')
print(df3)

   Courses_left      Fee Duration Courses_right  Discount
r1        Spark  20000.0   30days         Spark    2000.0
r2      PySpark  25000.0   40days           NaN       NaN
r3       Python  22000.0   35days        Python    1200.0
r4       pandas  30000.0   50days           NaN       NaN
r5          NaN      NaN      NaN            Go    2000.0
r6          NaN      NaN      NaN          Java    2300.0

In [15]:
df3=df1.set_index('Courses').join(df2.set_index('Courses'), how='inner')
print(df3)

           Fee Duration  Discount
Courses
Spark    20000   30days      2000
Python   22000   35days      1200

In [16]:
df3=df1.join(df2.set_index('Courses'), how='inner', on='Courses')
print(df3)

   Courses    Fee Duration  Discount
r1   Spark  20000   30days      2000
r3  Python  22000   35days      1200

In [17]:
import pandas as pd
technologies = {
    'Courses':["Spark","PySpark","Python","pandas"],
    'Fee' :[20000,25000,22000,30000],
    'Duration':['30days','40days','35days','50days'],
              }
index_labels=['r1','r2','r3','r4']
df1 = pd.DataFrame(technologies,index=index_labels)

technologies2 = {
    'Courses':["Spark","Java","Python","Go"],
    'Discount':[2000,2300,1200,2000]
              }
index_labels2=['r1','r6','r3','r5']
df2 = pd.DataFrame(technologies2,index=index_labels2)

In [18]:
df3= pd.merge(df1,df2)

In [19]:
df3

  Courses    Fee Duration  Discount
0   Spark  20000   30days      2000
1  Python  22000   35days      1200

In [20]:
df3=pd.merge(df1,df2, on='Courses')

In [21]:
df3

  Courses    Fee Duration  Discount
0   Spark  20000   30days      2000
1  Python  22000   35days      1200

In [22]:
df3=pd.merge(df1,df2, left_on='Courses', right_on='Courses')

In [23]:
df3

  Courses    Fee Duration  Discount
0   Spark  20000   30days      2000
1  Python  22000   35days      1200

In [24]:
df3 = pd.merge(df1,df2,left_index=True,right_index=True)

In [25]:
df3

   Courses_x    Fee Duration Courses_y  Discount
r1     Spark  20000   30days     Spark      2000
r3    Python  22000   35days    Python      1200

In [30]:
df3 = pd.merge(df3, df1,  how = 'left', left_on = ['col1','col2'], right_on = ['col1','col2'])

KeyError: 'col1'

In [28]:
print(df3)

   Courses_x    Fee Duration Courses_y  Discount
r1     Spark  20000   30days     Spark      2000
r3    Python  22000   35days    Python      1200

In [31]:
df3=pd.merge(df1,df2, on='Courses', how='left')
print(df3)

   Courses    Fee Duration  Discount
0    Spark  20000   30days    2000.0
1  PySpark  25000   40days       NaN
2   Python  22000   35days    1200.0
3   pandas  30000   50days       NaN

In [32]:
df3=pd.merge(df1,df2, on='Courses', how='right')
print(df3)

  Courses      Fee Duration  Discount
0   Spark  20000.0   30days      2000
1    Java      NaN      NaN      2300
2  Python  22000.0   35days      1200
3      Go      NaN      NaN      2000

In [33]:
df1

    Courses    Fee Duration
r1    Spark  20000   30days
r2  PySpark  25000   40days
r3   Python  22000   35days
r4   pandas  30000   50days

In [34]:
df2

   Courses  Discount
r1   Spark      2000
r6    Java      2300
r3  Python      1200
r5      Go      2000

In [35]:
import pandas as pd
df = pd.DataFrame({'Courses': ["Spark","PySpark","Python","pandas"],
                    'Fee' : [20000,25000,22000,24000]})

df1 = pd.DataFrame({'Courses': ["Pandas","Hadoop","Hyperion","Java"],
                    'Fee': [25000,25200,24500,24900]})

In [36]:
data = [df, df1]

In [37]:
df2 = pd.concat(data)

In [38]:
df2

    Courses    Fee
0     Spark  20000
1   PySpark  25000
2    Python  22000
3    pandas  24000
0    Pandas  25000
1    Hadoop  25200
2  Hyperion  24500
3      Java  24900

In [39]:
df2 = pd.concat([df, df1], ignore_index=True, sort=False)

In [40]:
df2

    Courses    Fee
0     Spark  20000
1   PySpark  25000
2    Python  22000
3    pandas  24000
4    Pandas  25000
5    Hadoop  25200
6  Hyperion  24500
7      Java  24900

In [41]:
import pandas as pd
df = pd.DataFrame({'Courses':["Spark","PySpark","Python","pandas"],
                      'Fee' :[20000,25000,22000,24000]})
  
df1 = pd.DataFrame({'Duration':['30day','40days','35days','60days'],
                      'Discount':[1000,2300,2500,2000,]}) 

#  Using pandas.concat() to join concat two DataFrames
df2 = pd.concat([df, df1], axis=1, join='inner')
print(df2)

   Courses    Fee Duration  Discount
0    Spark  20000    30day      1000
1  PySpark  25000   40days      2300
2   Python  22000   35days      2500
3   pandas  24000   60days      2000

In [42]:
df3 = pd.concat([df, df1, df2])

In [43]:
print(df3)

   Courses      Fee Duration  Discount
0    Spark  20000.0      NaN       NaN
1  PySpark  25000.0      NaN       NaN
2   Python  22000.0      NaN       NaN
3   pandas  24000.0      NaN       NaN
0      NaN      NaN    30day    1000.0
1      NaN      NaN   40days    2300.0
2      NaN      NaN   35days    2500.0
3      NaN      NaN   60days    2000.0
0    Spark  20000.0    30day    1000.0
1  PySpark  25000.0   40days    2300.0
2   Python  22000.0   35days    2500.0
3   pandas  24000.0   60days    2000.0

In [44]:
import pandas as pd
df = pd.DataFrame({'Courses': ["Spark","PySpark","Python","pandas"],
                    'Fee' : [20000,25000,22000,24000]})

df1 = pd.DataFrame({'Courses': ["Pandas","Hadoop","Hyperion","Java"],
                    'Fee': [25000,25200,24500,24900]})

In [45]:
df2 = df.append(df1)

In [46]:
df2

    Courses    Fee
0     Spark  20000
1   PySpark  25000
2    Python  22000
3    pandas  24000
0    Pandas  25000
1    Hadoop  25200
2  Hyperion  24500
3      Java  24900

In [47]:
print(df2)

    Courses    Fee
0     Spark  20000
1   PySpark  25000
2    Python  22000
3    pandas  24000
0    Pandas  25000
1    Hadoop  25200
2  Hyperion  24500
3      Java  24900

In [48]:
import pandas as pd

df = pd.DataFrame({'Courses': ["Spark","PySpark","Python","pandas"],
                    'Fee' : [20000,25000,22000,24000]})

df1 = pd.DataFrame({'Courses': ["Pandas","Hadoop","Hyperion","Java"],
                    'Fee': [25000,25200,24500,24900],
                    'Duration': ['30days','35days','40days','45days']})

# Using append() method
df2 = df.append(df1)
print(df2)

    Courses    Fee Duration
0     Spark  20000      NaN
1   PySpark  25000      NaN
2    Python  22000      NaN
3    pandas  24000      NaN
0    Pandas  25000   30days
1    Hadoop  25200   35days
2  Hyperion  24500   40days
3      Java  24900   45days

In [49]:
df2 = df.append(df1, ignore_index=True)
print(df2)

    Courses    Fee Duration
0     Spark  20000      NaN
1   PySpark  25000      NaN
2    Python  22000      NaN
3    pandas  24000      NaN
4    Pandas  25000   30days
5    Hadoop  25200   35days
6  Hyperion  24500   40days
7      Java  24900   45days

In [50]:
new_row = {'Courses':'Hyperion', 'Fee':24000}

In [51]:
df2=df.append(new_row, ignore_index=True)

In [52]:
df2

    Courses    Fee
0     Spark  20000
1   PySpark  25000
2    Python  22000
3    pandas  24000
4  Hyperion  24000

In [53]:
df2 = pd.DataFrame({'Courses':['PHP','GO'],
                    'Duration':['30day','40days'],
                    'Fee':[10000,23000]})

In [54]:
df3 = df.append([df1, df2], ignore_index=True)

In [55]:
print(df3)

    Courses    Fee Duration
0     Spark  20000      NaN
1   PySpark  25000      NaN
2    Python  22000      NaN
3    pandas  24000      NaN
4    Pandas  25000   30days
5    Hadoop  25200   35days
6  Hyperion  24500   40days
7      Java  24900   45days
8       PHP  10000    30day
9        GO  23000   40days

In [56]:
import pandas as pd
import numpy as np
df = pd.DataFrame(({
     'Courses':["Spark",'Java',"Scala",'Python'],
     'Fee' :[20000,np.nan,26000,24000],
     'Duration':['30days','40days','NA','40days'],
     'Discount':[1000,np.nan,2500,None]
               }))
print(df)

  Courses      Fee Duration  Discount
0   Spark  20000.0   30days    1000.0
1    Java      NaN   40days       NaN
2   Scala  26000.0       NA    2500.0
3  Python  24000.0   40days       NaN

In [57]:
df2=df.fillna('None')

In [58]:
df

  Courses      Fee Duration  Discount
0   Spark  20000.0   30days    1000.0
1    Java      NaN   40days       NaN
2   Scala  26000.0       NA    2500.0
3  Python  24000.0   40days       NaN

In [59]:
df2['Discount'] =  df['Discount'].fillna('0')

In [60]:
print(df2)

  Courses      Fee Duration Discount
0   Spark  20000.0   30days   1000.0
1    Java     None   40days        0
2   Scala  26000.0       NA   2500.0
3  Python  24000.0   40days        0

In [61]:
df2[['Discount','Fee']] =  df[['Discount','Fee']].fillna('0')

In [62]:
df2

  Courses      Fee Duration Discount
0   Spark  20000.0   30days   1000.0
1    Java        0   40days        0
2   Scala  26000.0       NA   2500.0
3  Python  24000.0   40days        0

In [66]:
df2 = df.fillna(value={'Discount':0,'Fee':0}, limit = 1)

In [67]:
df2

  Courses      Fee Duration  Discount
0   Spark  20000.0   30days    1000.0
1    Java      0.0   40days       0.0
2   Scala  26000.0       NA    2500.0
3  Python  24000.0   40days       NaN

In [68]:
import pandas as pd
import numpy as np
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas",np.nan],
    'Fee' :[20000,25000,26000,23093,24000,np.nan],
    'Duration':['30day','40days','35days','45days',np.nan,np.nan],
    'Discount':[1000,np.nan,1200,2500,pd.NaT,np.nan],
    '':[np.nan,np.nan,np.nan,np.nan,np.nan,np.nan]
              }
index_labels=['r1','r2','r3','r4','r5','']
df = pd.DataFrame(technologies,index=index_labels)
print(df)

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000 NaN
r2  PySpark  25000.0   40days      NaN NaN
r3   Hadoop  26000.0   35days     1200 NaN
r4   Python  23093.0   45days     2500 NaN
r5   pandas  24000.0      NaN      NaT NaN
        NaN      NaN      NaN      NaN NaN

In [69]:
df = df.dropna(how='all')

In [70]:
df

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000 NaN
r2  PySpark  25000.0   40days      NaN NaN
r3   Hadoop  26000.0   35days     1200 NaN
r4   Python  23093.0   45days     2500 NaN
r5   pandas  24000.0      NaN      NaT NaN

In [71]:
df = df.dropna(how='all',axis=1)

In [72]:
print(df)

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000
r2  PySpark  25000.0   40days      NaN
r3   Hadoop  26000.0   35days     1200
r4   Python  23093.0   45days     2500
r5   pandas  24000.0      NaN      NaT

In [73]:
print(df)

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000
r2  PySpark  25000.0   40days      NaN
r3   Hadoop  26000.0   35days     1200
r4   Python  23093.0   45days     2500
r5   pandas  24000.0      NaN      NaT

In [74]:
print(df2)

  Courses      Fee Duration  Discount
0   Spark  20000.0   30days    1000.0
1    Java      0.0   40days       0.0
2   Scala  26000.0       NA    2500.0
3  Python  24000.0   40days       NaN

In [75]:
df2=df.dropna()

In [76]:
df2

   Courses      Fee Duration Discount
r1   Spark  20000.0    30day     1000
r3  Hadoop  26000.0   35days     1200
r4  Python  23093.0   45days     2500

In [77]:
df2=df.dropna(subset=['Courses','Duration'])

In [78]:
df2

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000
r2  PySpark  25000.0   40days      NaN
r3   Hadoop  26000.0   35days     1200
r4   Python  23093.0   45days     2500

In [79]:
df2=df.dropna(thresh=2)

In [80]:
df2

    Courses      Fee Duration Discount
r1    Spark  20000.0    30day     1000
r2  PySpark  25000.0   40days      NaN
r3   Hadoop  26000.0   35days     1200
r4   Python  23093.0   45days     2500
r5   pandas  24000.0      NaN      NaT

In [106]:
import pandas as pd
courses = {'Course':['biotechnology','Bioinformatics','Nanotechnology'],
            'Strength':[1,2,3],
            'Name': ['Anuradha','Arundhuti','Anirban']
       }

df = pd.DataFrame.from_dict(courses)
df

TypeError: from_dict() got an unexpected keyword argument 'index'

In [116]:
df = pd.DataFrame(courses,index=['r1','r2','r3'])
df

            Course  Strength       Name
r1   biotechnology         1   Anuradha
r2  Bioinformatics         2  Arundhuti
r3  Nanotechnology         3    Anirban

In [117]:
df = pd.DataFrame(courses, columns =['Course','Id','Name'])
df

           Course   Id       Name
0   biotechnology  NaN   Anuradha
1  Bioinformatics  NaN  Arundhuti
2  Nanotechnology  NaN    Anirban

In [137]:
Course1 = {'r0':{'Courses':'Spark','Fee':'20000','Duration':'35days'},
           'r1':{'Courses':'PySpark','Fee':'20000','Duration':'35days'},
           'r2':{'Courses':'Java','Fee':'15000','Duration':'40days'},
           'r3':{'Courses':'PHP','Fee':'10000','Duration':'30days'}}

columns = ['Courses','Fee','Duration']

df =pd.DataFrame.from_dict(Course1, orient = 'index',columns = columns)

In [138]:
print(df)

    Courses    Fee Duration
r0    Spark  20000   35days
r1  PySpark  20000   35days
r2     Java  15000   40days
r3      PHP  10000   30days

In [140]:
import pandas as pd
import numpy as np
technologies = {
    'Courses':["Spark",np.nan,"Hadoop","Python","pandas",np.nan,"Java"],
    'Fee' :[20000,25000, np.nan,22000,24000,np.nan,22000],
    'Duration':[np.nan,'40days','35days', np.nan,'60days','50days','55days'],
    'Discount':[1000,np.nan,1500,np.nan,2500,2100,np.nan]}
df = pd.DataFrame(technologies)
df

  Courses      Fee Duration  Discount
0   Spark  20000.0      NaN    1000.0
1     NaN  25000.0   40days       NaN
2  Hadoop      NaN   35days    1500.0
3  Python  22000.0      NaN       NaN
4  pandas  24000.0   60days    2500.0
5     NaN      NaN   50days    2100.0
6    Java  22000.0   55days       NaN

In [143]:
df2 = df.replace(np.nan, '')

In [142]:
df2

  Courses      Fee Duration Discount
0   Spark  20000.0            1000.0
1          25000.0   40days
2  Hadoop            35days   1500.0
3  Python  22000.0
4  pandas  24000.0   60days   2500.0
5                    50days   2100.0
6    Java  22000.0   55days

In [147]:
df2 = df[['Fee','Courses']] = df[['Fee','Courses']].fillna(' ')

In [148]:
df2

       Fee Courses
0  20000.0   Spark
1  25000.0
2           Hadoop
3  22000.0  Python
4  24000.0  pandas
5
6  22000.0    Java

In [149]:
df2 = df.fillna(" ")

In [150]:
df2

  Courses      Fee Duration Discount
0   Spark  20000.0            1000.0
1          25000.0   40days
2  Hadoop            35days   1500.0
3  Python  22000.0
4  pandas  24000.0   60days   2500.0
5                    50days   2100.0
6    Java  22000.0   55days

In [151]:
df2 = df.Courses.fillna()

In [155]:
df2

0     Spark
1
2    Hadoop
3    Python
4    pandas
5
6      Java
Name: Courses, dtype: object

In [159]:
df2 = df['Courses']=df['Courses'].fillna(0)

In [161]:
print(df2)

0     Spark
1
2    Hadoop
3    Python
4    pandas
5
6      Java
Name: Courses, dtype: object

In [162]:
df2 = df['Discount']=df['Discount'].fillna(0)
print(df2)

0    1000.0
1
2    1500.0
3
4    2500.0
5    2100.0
6
Name: Discount, dtype: object

In [164]:
df2 = df.Courses.replace('', 'value', regex = True)
print(df2)

0     Spark
1     value
2    Hadoop
3    Python
4    pandas
5     value
6      Java
Name: Courses, dtype: object